import hashlib

ne={
1:['杭州-新安江水库','杭州',1010571,'HZ','HZ00079','建德'],
2:['杭州-大洋镇麻车','杭州',1010571,'HZ','HZ00079','建德'],
3:['杭州-新安江寿昌江口','杭州',1010571,'HZ','HZ00079','建德'],
4:['杭州-青山水库','杭州',1010571,'HZ','HZ00485','临安'],
5:['杭州-青山殿水库','杭州',1010571,'HZ','HZ00485','临安'],
6:['杭州-富春江水电厂','杭州',1010571,'HZ','HZ00148','桐庐'],
7:['杭州-桐庐水文站','杭州',1010571,'HZ','HZ00148','桐庐'],
8:['杭州-之江水文站','杭州',1010571,'HZ','HZ05019','西湖分局'],
9:['杭州-北湖分洪闸','杭州',1010571,'HZ','HZ00185','余杭'],
10:['杭州-瓶窑老街','杭州',1010571,'HZ','HZ00185','余杭'],
11:['杭州-瓶窑水文站','杭州',1010571,'HZ','HZ00185','余杭'],
12:['嘉兴-长山河闸闸下游','嘉兴',1010573,'JX','JX100026','海盐'],
13:['嘉兴-海盐南台头闸','嘉兴',1010573,'JX','JX100026','海盐'],
14:['金华-兰溪水文站（省控）','金华',1010579,'JH','JH57903','兰溪'],
15:['金华-义乌佛堂水文站（省控）','金华',1010579,'JH','IDBU000100020010','义乌'],
16:['金华-金华水文站（省控）','金华',1010579,'JH','IDBU000100160522','金华市本级'],
17:['丽水-上显滩水文站','丽水',1010578,'LS','LSIDBU000100030002','莲都分局'],
18:['丽水-青田滩坑水库','丽水',1010578,'LS','LSIDBU000100030004','青田'],
19:['丽水-云和紧水滩水库','丽水',1010578,'LS','LSIDBU000100030009','云和'],
20:['宁波-宁波水文站','宁波',1010574,'NB','IDBU000100020698','宁波市本级'],
21:['绍兴-嵊州黄泽水文站','绍兴',1010575,'SX','SX1004','嵊州'],
22:['绍兴-安华水库1','绍兴',1010575,'SX','SX6000','诸暨'],
23:['绍兴-安华水库2','绍兴',1010575,'SX','SX6000','诸暨'],
24:['绍兴-太平桥水文站','绍兴',1010575,'SX','SX6000','诸暨'],
25:['绍兴-诸暨水文站','绍兴',1010575,'SX','SX6000','诸暨'],
26:['绍兴-绍兴水文站','绍兴',1010575,'SX','IDBU000100110982','绍兴市本级'],
27:['台州-黄岩长潭水库','台州',1010576,'TZ','TZ2002','黄岩分局'],
28:['台州-临海牛头山水库','台州',1010576,'TZ','TZ2005','临海'],
29:['台州-黄岩长潭水库','台州',1010576,'TZ','TZ2002','黄岩分局']}

#sql="insert into t_ne_library (
#s_ne_id ,             +"'"+hashlib.md5(str('/Ems=省网管全球眼网管/Ne=%s'%(ne[i][0])).encode(encoding='GBK')).hexdigest().upper()
#s_ne_name,            ','+"'"+ne[i][0]+"'"+
#s_ne_code,            ','+"'"+ne[i][0]+"'"+
#i_spec_id,            ','+'9'+
#s_spec_name,          ','+"'"+'网络监控'+"'"+
#s_ne_type,            ','+'3025'+
#i_ems_id,             ','+'5569597008'+
#s_ems_name,           ','+"'"+'省网管全球眼网管'+"'"+
#i_data_domain_id,     ','+'1030005'+
#i_city_id,            ','+"'"+str(ne[i][2])+"'"+
#s_city_code,          ','+"'"+ne[i][3]+"'"+
#s_city_name,          ','+"'"+ne[i][1]+"'"+
#s_county_name,        ','+"'"+ne[i][5]+"'"+
#s_county_code,        ','+"'"+ne[i][4]+"'"+
#s_ne_alias,           ','+"'"+ne[i][0]+"'"+
#s_ne_friend_name,     ','+"'"+ne[i][0]+"'"+
#s_ne_moi_name         ','+"'"+/Ems=省网管全球眼网管/Ne=ne[i][0]
#) values();"

#sql="insert into t_ne_library(s_ne_id,s_ne_name,s_ne_code,i_spec_id,s_spec_name,s_ne_type,i_ems_id,s_ems_name,i_data_domain_id,i_city_id,s_city_code,s_city_name,s_county_name,s_county_code,s_ne_alias,s_ne_friend_name,s_ne_moi_name)
#values(
for i in range(1,29):
    print('insert into t_ne_library(s_ne_id,s_ne_name,s_ne_code,i_spec_id,s_spec_name,s_ne_type,i_ems_id,s_ems_name,i_data_domain_id,i_city_id,s_city_code,s_city_name,s_county_name,s_county_code,s_ne_alias,s_ne_friend_name,s_ne_moi_name) values('+"'"+hashlib.md5(str('\/Ems=省网管全球眼网管\/Ne=%s'%ne[i][0]).encode(encoding='GBK')).hexdigest().upper()+"'"+','+"'"+ne[i][0]+"'"+','+"'"+ne[i][0]+"'"+','+'9'+','+"'"+'网络监控'+"'"+','+'3025'+','+'5569597008'+','+"'"+'省网管全球眼网管'+"'"+','+'1030005'+','+str(ne[i][2])+','+"'"+ne[i][3]+"'"+','+"'"+ne[i][1]+"'"+','+"'"+ne[i][5]+"'"+','+"'"+ne[i][4]+"'"+','+"'"+ne[i][0]+"'"+','+"'"+ne[i][0]+"'"+','+"'"+'/Ems=省网管全球眼网管/Ne='+ne[i][0]+"'"+');')


#print(hashlib.md5(str('\/Ems=省网管全球眼网管\/Ne=%s'%ne[i][0]).encode(encoding='GBK')).hexdigest().upper())
#'\/Ems=省网管全球眼网管\/Ne=杭州-新安江水库'
#
